.emacs_test.d/config.org
#+TITLE: Emacs configuration
#+DESCRIPTION: An org-babel based emacs configuration
#+LANGUAGE: en
#+PROPERTY: results silent
#+STARTUP: overview
* Learning resources
|------------------------+-----------------------------------------------------------------------------|
| Link                   | description                                                                 |
|------------------------+-----------------------------------------------------------------------------|
| C-h t                  | Emacs tutorial                                                              |
| [[https://www.youtube.com/channel/UCDEtZ7AKmwS0_GNJog01D2g][Uncle Dave youtube]]     | Uncle Dave's youtube videos explain emacs configuration                     |
| [[https://www.youtube.com/channel/UCxkMDXQ5qzYOgXPRnOBrp1w][Mike Zamansky youtube]]  | Has a great set of videos on Emacs, computer science etc                    |
| [[https://www.udemy.com/course/getting-yourself-organized-with-org-mode/][Rainer Konig udemy]]     | Rainer Konig Udemy org-mode course, structured pdf and videos               |
| [[https://www.youtube.com/channel/UCfbGTpcJyEOMwKP-eYz3_fg][Rainer Konig youtube]]   | Youtube channel also from Rainer                                            |
| [[https://www.youtube.com/channel/UCQp2VLAOlvq142YN3JO3y8w][John Kitchin youtube]]   | This guy made org-ref and is an academic sensei                             |
| [[http://kitchingroup.cheme.cmu.edu/blog/category/emacs/1/][Kitchin research group]] | John Kitchin's research group site has a ton of resources emacs related     |
| C-h                    | This brings up a list with all types of help. E.g.C-h b describes bindings. |
| C-h c COMMAND          | Display name of the function (brief description of the command)             |
| C-h k COMMAND          | Display documentation of the function by typing the command                 |
| C-h f FUNCTION NAME    | Display documentation of the function by typing the function name           |
| C-h v                  | Display documentation of variables                                          |
| C-h a                  | Type keyword to list all commands whose names contain that keyword          |
| C-h i                  | Info - Read included manuals of installed packages                          |
|------------------------+-----------------------------------------------------------------------------|
* Explanation
So! You've found yourself on my personal emacs configuration files. First of all, welcome! To start, there are a total of three files needed for my configuration.

1. *init.el* is where the initial configuration of emacs begins. We initialize some stuff so we can use packages, require org, and load the other two important files!
2. *config.org* that is this file! Here we do some basic configuration that does not need a lot from your part. It is just my bare-bones emacs without fancy (and very usefull) extra stuff. The only thing to get started here, is to write down the path to the folder in which these three files live.
3. *config_custom.org* is where the magic happens. Well, extensive functionality that turns emacs from amazing to insane in the membrane! Here we also put shortcuts to other config files for quick access, we use org-journal, org-ref and org-roam (amazing combination). Basically everything that requires a bit more configuration on your part.

Have fun, and don't forget to adjust the emacs path!
* File layout and paths
Some standard files for configuring. The only important thing here to edit is *emacs-dir* to the directory of your emacs configuration. Don't forget!!!
#+BEGIN_SRC emacs-lisp
  ;; General directories
  (setq github-dir "~/github/")
  (setq dropbox-dir "~/Dropbox/")
  (setq emacs-dir "~/.emacs_test.d/")

  ;; Configuration files
  (setq emacs-config-org-file (concat emacs-dir "config.org"))
  (setq emacs-config-custom-org-file (concat emacs-dir "config_custom.org"))

  ;; More specific files
  (setq amx-items (concat emacs-dir "amx-items"))
  (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")

  ;; Backup files
  (setq backup-per-save (concat emacs-dir "backup/per-save"))
  (setq backup-per-session (concat emacs-dir "backup/per-session"))

  ;; Configuration files
  (setq zshrc-file "~/.zshrc")
  (setq skhdrc-file "~/.skhdrc")
  (setq qmk-keymap-file "~/qmk_firmware/keyboards/keebio/iris/keymaps/popoiopo/keymap.c")
  (setq yabai-file "~/.yabairc")
  (setq qutebrowser-file "~/.qutebrowser/qutemacs.py")

  ;; Roam
  (setq roamnotes-path (concat dropbox-dir "roam_notes/"))
  (setq roam-db-path "~/org-roam.db")

  ;; More specific files
  (setq org-journal-path (concat roamnotes-path "org-journal/"))
  (setq journal-file (concat org-journal-path "2021.org"))

  ;; Reference managing
  (setq bib-folder-path (concat roamnotes-path "papers_and_articles/"))
  (setq bib-org-file (concat bib-folder-path "references.org"))
  (setq references-bib-file (concat bib-folder-path "references.bib"))

  ;; GTD
  (setq gtd-path (concat roamnotes-path "gtd/"))
  (setq work-gtd-file (concat gtd-path "work.org"))
  (setq personal-gtd-file (concat gtd-path "personal.org"))
  (setq phone-gtd-file (concat gtd-path "phone.org"))
#+END_SRC
* Configuration
** Autocompletions
*** Company (autocompletion framework)
Company is a text completion framework for Emacs. The name stands for "complete anything". It uses pluggable back-ends and front-ends to retrieve and display completion candidates. See documentation on [[http://company-mode.github.io/][this site]].
#+BEGIN_SRC emacs-lisp
  (use-package company
    :ensure t
    :init
    (add-hook 'after-init-hook 'global-company-mode))
#+END_SRC
*** Electric pairing
Automatically pair the following elements on autocorrect. This is enabled in the [[*Standards (minor modes and minor improvements)][Standards (minor modes and minor improvements)]] through electric-pair-mode.

#+BEGIN_SRC emacs-lisp
  (setq electric-pair-pairs '(
                              (?\( . ?\))
                              (?\[ . ?\])
                              (?\" . ?\")
                              (?\{ . ?\})
                              (?\< . ?\>)
                              ))
#+END_SRC
*** IDO autocomplete filename searches
Ivy takes care of autocompleting filenames in the minibuffer at the bottom of the screen. It also keeps typing paths to a minimum as a folder is just an enter away.
#+BEGIN_SRC emacs-lisp
  (ivy-mode 1)
  (setq ivy-use-virtual-buffers t)
  (setq enable-recursive-minibuffers t)
  (global-set-key "\C-s" 'swiper)
#+END_SRC

Makes sure that M-x also generates suggestions. Otherwise you'd have to remember everything and not get autocompleted in M-x functions. Amx is the newer version of smex.
#+BEGIN_SRC emacs-lisp
  (use-package amx
    :ensure t
    :after ivy
    :custom
    (amx-backend 'auto)
    (ams-save-file amx-items)
    (amx-history-length 50)
    (amx-show-key-bindings nil)
    :config
    (amx-mode 1))
#+END_SRC
*** Yassnippet
Yassnippet is the templating system that is used. It creates a folder called snippets in which you can make a folder for each major mode you'd want a template for. E.g., python can have a few snippets to prettyfie a matplotlib graph, or org can have a template for exporting to a latex article or an html webpage.
#+BEGIN_SRC emacs-lisp
  (use-package yasnippet
    :ensure t
    :config (use-package yasnippet-snippets
              :ensure t)
    (yas-reload-all))
  (yas-global-mode 1)
#+END_SRC
** Buffers
All things buffer related
*** Buffer-move
Be able to swap buffers. See [[*Custom keystrokes][Custom keystrokes]] for shortcuts (buf-move-xxx).
#+BEGIN_SRC emacs-lisp
(use-package buffer-move
  :ensure t)
#+END_SRC
*** Ibuffer
Just a new buffer that lists the open buffers. It provides easy ways to close multiple buffers at once and navigate through them.
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (setq ibuffer-expert t)
#+END_SRC
*** Killing buffers
**** Always kill current buffer
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x k") 'kill-current-buffer)
#+END_SRC
**** Kill all buffers
#+BEGIN_SRC emacs-lisp
  (defun kill-all-buffers ()
    (interactive)
    (mapc 'kill-buffer (buffer-list)))
  (global-set-key (kbd "C-M-s-k") 'kill-all-buffers)
#+END_SRC
