.emacs_test.d/exported-org-files/config.tex
% Created 2020-12-12 Sat 17:44
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Bas Chatel}
\date{\today}
\title{Emacs configuration}
\hypersetup{
 pdfauthor={Bas Chatel},
 pdftitle={Emacs configuration},
 pdfkeywords={},
 pdfsubject={An org-babel based emacs configuration},
 pdfcreator={Emacs 27.1 (Org mode 9.4)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Learning resources}
\label{sec:org3eca0b1}
\begin{center}
\begin{tabular}{ll}
\hline
Link & description\\
\hline
C-h t & Emacs tutorial\\
\href{https://www.youtube.com/channel/UCDEtZ7AKmwS0\_GNJog01D2g}{Uncle Dave youtube} & Uncle Dave's youtube videos explain emacs configuration\\
\href{https://www.youtube.com/channel/UCxkMDXQ5qzYOgXPRnOBrp1w}{Mike Zamansky youtube} & Has a great set of videos on Emacs, computer science etc\\
\href{https://www.udemy.com/course/getting-yourself-organized-with-org-mode/}{Rainer Konig udemy} & Rainer Konig Udemy org-mode course, structured pdf and videos\\
\href{https://www.youtube.com/channel/UCfbGTpcJyEOMwKP-eYz3\_fg}{Rainer Konig youtube} & Youtube channel also from Rainer\\
\href{https://www.youtube.com/channel/UCQp2VLAOlvq142YN3JO3y8w}{John Kitchin youtube} & This guy made org-ref and is an academic sensei\\
\href{http://kitchingroup.cheme.cmu.edu/blog/category/emacs/1/}{Kitchin research group} & John Kitchin's research group site has a ton of resources emacs related\\
C-h & This brings up a list with all types of help. E.g.C-h b describes bindings.\\
C-h c COMMAND & Display name of the function (brief description of the command)\\
C-h k COMMAND & Display documentation of the function by typing the command\\
C-h f FUNCTION NAME & Display documentation of the function by typing the function name\\
C-h v & Display documentation of variables\\
C-h a & Type keyword to list all commands whose names contain that keyword\\
C-h i & Info - Read included manuals of installed packages\\
\hline
\end{tabular}
\end{center}
\section{Explanation}
\label{sec:org0795747}
So! You've found yourself on my personal emacs configuration files. First of all, welcome! To start, there are a total of three files needed for my configuration.

\begin{enumerate}
\item \textbf{init.el} is where the initial configuration of emacs begins. We initialize some stuff so we can use packages, require org, and load the other two important files!
\item \textbf{config.org} that is this file! Here we do some basic configuration that does not need a lot from your part. It is just my bare-bones emacs without fancy (and very usefull) extra stuff. The only thing to get started here, is to write down the path to the folder in which these three files live.
\item \textbf{config\textsubscript{custom.org}} is where the magic happens. Well, extensive functionality that turns emacs from amazing to insane in the membrane! Here we also put shortcuts to other config files for quick access, we use org-journal, org-ref and org-roam (amazing combination). Basically everything that requires a bit more configuration on your part.
\end{enumerate}

Have fun, and don't forget to adjust the emacs path!

\section{File layout and paths}
\label{sec:orgc59bde4}
Some standard files for configuring. The only important thing here to edit is \textbf{emacs-dir} to the directory of your emacs configuration. Don't forget!!!
\begin{verbatim}
;; General directories
(setq emacs-dir "~/.emacs_test.d/")

;; Configuration files
(setq emacs-config-org-file (concat emacs-dir "config.org"))
(setq emacs-config-custom-org-file (concat emacs-dir "config_custom.org"))

;; More specific files
(setq amx-items (concat emacs-dir "amx-items"))
(setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
(setq backup-per-save (concat emacs-dir "backup/per-save"))
(setq backup-per-session (concat emacs-dir "backup/per-session"))

;; DOEN HET NOG NIET
(setq libre-office-path "/Applications/LibreOffice.app/Contents/MacOS/soffice")
\end{verbatim}

\section{Configuration}
\label{sec:org6a48104}
\subsection{Autocompletions}
\label{sec:org16d3ea7}
\subsubsection{Company (autocompletion framework)}
\label{sec:orgd6b77b0}
Company is a text completion framework for Emacs. The name stands for "complete anything". It uses pluggable back-ends and front-ends to retrieve and display completion candidates. See documentation on \href{http://company-mode.github.io/}{this site}.
\begin{verbatim}
(use-package company
  :ensure t
  :init
  (add-hook 'after-init-hook 'global-company-mode))
\end{verbatim}
\subsubsection{Electric pairing}
\label{sec:orgdead021}
Automatically pair the following elements on autocorrect. This is enabled in the \hyperref[sec:orgac19acf]{Standards (minor modes and minor improvements)} through electric-pair-mode.

\begin{verbatim}
(setq electric-pair-pairs '(
			    (?\( . ?\))
			    (?\[ . ?\])
			    (?\" . ?\")
			    (?\{ . ?\})
			    (?\< . ?\>)
			    ))
\end{verbatim}
\subsubsection{IDO autocomplete filename searches}
\label{sec:orga572c66}
Ivy takes care of autocompleting filenames in the minibuffer at the bottom of the screen. It also keeps typing paths to a minimum as a folder is just an enter away.
\begin{verbatim}
(ivy-mode 1)
(setq ivy-use-virtual-buffers t)
(setq enable-recursive-minibuffers t)
(global-set-key "\C-s" 'swiper)
\end{verbatim}

Makes sure that M-x also generates suggestions. Otherwise you'd have to remember everything and not get autocompleted in M-x functions. Amx is the newer version of smex.
\begin{verbatim}
(use-package amx
  :ensure t
  :after ivy
  :custom
  (amx-backend 'auto)
  (ams-save-file amx-items)
  (amx-history-length 50)
  (amx-show-key-bindings nil)
  :config
  (amx-mode 1))
\end{verbatim}
\subsubsection{Yassnippet}
\label{sec:org5c055f2}
Yassnippet is the templating system that is used. It creates a folder called snippets in which you can make a folder for each major mode you'd want a template for. E.g., python can have a few snippets to prettyfie a matplotlib graph, or org can have a template for exporting to a latex article or an html webpage.
\begin{verbatim}
(use-package yasnippet
  :ensure t
  :config (use-package yasnippet-snippets
	    :ensure t)
  (yas-reload-all))
(yas-global-mode 1)
\end{verbatim}
\subsection{Buffers}
\label{sec:orgd33be40}
All things buffer related
\subsubsection{Buffer-move}
\label{sec:org524e9ae}
Be able to swap buffers. See \hyperref[sec:org25ccc0c]{Custom keystrokes} for shortcuts (buf-move-xxx).
\begin{verbatim}
(use-package buffer-move
  :ensure t)
\end{verbatim}
\subsubsection{Ibuffer}
\label{sec:org2ca85a6}
Just a new buffer that lists the open buffers. It provides easy ways to close multiple buffers at once and navigate through them.
\begin{verbatim}
(global-set-key (kbd "C-x C-b") 'ibuffer)
(setq ibuffer-expert t)
\end{verbatim}
\subsubsection{Killing buffers}
\label{sec:org1541d17}
\begin{enumerate}
\item Always kill current buffer
\label{sec:org732405a}
\begin{verbatim}
(global-set-key (kbd "C-x k") 'kill-current-buffer)
\end{verbatim}
\item Kill all buffers
\label{sec:org65c29c1}
\begin{verbatim}
(defun kill-all-buffers ()
  (interactive)
  (mapc 'kill-buffer (buffer-list)))
(global-set-key (kbd "C-M-s-k") 'kill-all-buffers)
\end{verbatim}
\end{enumerate}
