.emacs_test.d/config.org
*** Transparency
#+BEGIN_SRC emacs-lisp
  ;;(set-frame-parameter (selected-frame) 'alpha '(<active> . <inactive>))
  ;;(set-frame-parameter (selected-frame) 'alpha <both>)
  (set-frame-parameter (selected-frame) 'alpha '(100 . 100))
  (add-to-list 'default-frame-alist '(alpha . (100 . 100)))

  (defun toggle-transparency ()
     (interactive)
     (let ((alpha (frame-parameter nil 'alpha)))
       (set-frame-parameter
        nil 'alpha
        (if (eql (cond ((numberp alpha) alpha)
                       ((numberp (cdr alpha)) (cdr alpha))
                       ;; Also handle undocumented (<active> <inactive>) form.
                       ((numberp (cadr alpha)) (cadr alpha)))
                 100)
            '(95 . 95) '(100 . 100)))))
#+END_SRC
** Navigation
*** avy
Avy is a powerful search package that lets you quickly navigate to wherever in your screen you want to go.
#+BEGIN_SRC emacs-lisp
  (use-package avy :ensure t)
#+END_SRC
*** Multiple Cursors
Use multi cursor editing easily. For keybindings, see [[*Custom keystrokes][Custom keystrokes]].
#+BEGIN_SRC emacs-lisp
  (require 'multiple-cursors)
#+END_SRC
*** expand-region
#+BEGIN_SRC emacs-lisp
  ;;expand region
  (require 'expand-region)
  (global-set-key (kbd "C-=") 'er/expand-region)
#+END_SRC
** Org
*** Writing improvements
Some of the adjustments are *stolen* from [[https://explog.in/notes/writingsetup.html][this guy]]. It mainly revolves around using screenspace efficiently instead of randomly adding whitespace, or not displaying whitespace where there actually is whitespace.
#+BEGIN_SRC emacs-lisp
  (setq org-indent-indentation-per-level 1)             ;; Shorten the space on the left side with org headers
  (setq org-adapt-indentation nil)                      ;; Adapt indentation to outline node level. Set to nill as it takes up space.
  (setq org-hide-emphasis-markers t)                    ;; When making something bold *Hallo*, hide stars. Goes for all emphasis markers.
  (setq org-cycle-separator-lines 1)                    ;; Leave a single empty line between headers if there is one. Otherwise leave no room or make the empty lines belong to the previous header.
  (setq org-hide-leading-stars 't)                      ;; Hide the extra stars in front of a header (org-bullet displays nicer, but why add extra package)
  (customize-set-variable 'org-blank-before-new-entry
                          '((heading . nil)
                            (plain-list-item . nil)))   ;; Dont randomly remove newlines below headers
#+END_SRC
*** Image size
Make standard size for org images. Otherwise they can become gigantic!
#+BEGIN_SRC emacs-lisp
    (setq org-image-actual-width 600)
#+END_SRC
*** [#B] Priorities
#+BEGIN_SRC emacs-lisp
  (setq org-priority-highest ?A)
  (setq org-priority-default ?C)
  (setq org-priority-lowest ?E)
#+END_SRC
*** Org-babel
#+BEGIN_SRC emacs-lisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t) (python . t) (shell . t) (dot . t)))
#+END_SRC
*** Org capture
When initializing an org-capture, it eats up basically your whole layout. This piece of code prevents that and just uses an existing window, albeit somewhat random as to which one is chosen.
#+BEGIN_SRC emacs-lisp
  (defun my-org-capture-place-template-dont-delete-windows (oldfun args)
    (cl-letf (((symbol-function 'delete-other-windows) 'ignore))
      (apply oldfun args)))

  (with-eval-after-load "org-capture"
    (advice-add 'org-capture-place-template :around 'my-org-capture-place-template-dont-delete-windows))
#+END_SRC
** Standards (minor modes and minor improvements)
*** Alter annoying defaults
Small defaults to be changed as minor improvements. The changes are summarized next to it.
#+BEGIN_SRC emacs-lisp
  (setq save-interprogram-paste-before-kill t) ;; Perpetuates system clipboard
  (setq scroll-conservatively 1)      ;; Keep from making huge jumps when scrolling
  (setq ring-bell-function 'ignore)   ;; Unable annoying sounds
  (setq visible-bell 1)               ;; disable annoying windows sound
  (setq inhibit-startup-message t)    ;; Hide the startup message
  (setq display-time-24hr-format t)   ;; Format clock
  (setq-default display-line-numbers 'relative) ;; Setting the line numbers
  (when window-system (global-hl-line-mode t)) ;; Get a current line shadow in IDE
  (defalias 'yes-or-no-p 'y-or-n-p)   ;; Replace yes questions to y
  (add-hook 'before-save-hook 'delete-trailing-whitespace) ;; I never want whitespace at the end of lines. Remove it on save.
  (setq sentence-end-double-space nil);; Start a new sentence with just a single space instead of 2
  (exec-path-from-shell-initialize)   ;; Fixes path issues on mac emacs.app so that same env of terminal is used
  (setq org-agenda-window-setup 'current-window) ;; When opening the agenda, open it in current window instead of messing up the layout
#+END_SRC
*** Hungry-delete
Deletes all whitespace with a single delete of backspace.
#+BEGIN_SRC emacs-lisp
  (use-package hungry-delete
    :ensure t
    :config (global-hungry-delete-mode))
#+END_SRC
*** Minor modes
Some minor modes that are turned on or off. Next to each, a short description is given of what it changes.
#+BEGIN_SRC emacs-lisp
  (tool-bar-mode -1)                  ;; Get rid of tool-bar
  (menu-bar-mode -1)                  ;; Git rid of menu
  (scroll-bar-mode -1)                ;; Get rid of scroll-bar
  (global-auto-revert-mode 1)         ;; Make sure that you're always looking at the latest version of a file. Change file when changed on disk
  (delete-selection-mode 1)           ;; Remove text from selection instead of just inserting text
  (display-time-mode 1)               ;; Set clock on lower right side
  ;; (electric-pair-mode t)              ;; Enable electric pair mode. It autocompletes certain pairs. E.g., (), {}, [], <>
  (global-subword-mode 1)             ;; Cause M-f to move forward per capitalization within a word. E.g., weStopAtEveryCapital
  (global-visual-line-mode 1)                ;; Make sure that lines do not disapear at the right side of the screen but wrap around
  (add-hook 'prog-mode-hook 'electric-pair-mode)
#+END_SRC
*** Popup kill-ring
Show options out of the kill ring instead of cycling through each option.
#+BEGIN_SRC emacs-lisp
  (use-package popup-kill-ring
    :ensure t
    :bind ("M-y" . popup-kill-ring))
#+END_SRC
*** Which key
Provides options for keystrokes. Super useful!
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :init
    (which-key-mode))
#+END_SRC
*** TODOS
#+BEGIN_SRC emacs-lisp
  (setq org-todo-keyword-faces
	'(
	  ("NEXT" . (:foreground "#05d3fc" :weight bold :box (:line-width 2 :style released-button)))
	  ("MEETING" . (:foreground "#b28e00" :weight bold :box (:line-width 2 :style released-button)))
	  ("DELEGATED" . (:foreground "#b28e00" :weight bold :box (:line-width 2 :style released-button)))
	  ("WAITING" . (:foreground "#fcca05" :weight bold :box (:line-width 2 :style released-button)))
	  ("FLEETING" . (:foreground "#f62af9" :weight bold :box (:line-width 2 :style released-button)))
	  ("PROJ" . (:foreground "#a768f9" :weight bold :box (:line-width 2 :style released-button)))
	  ("LONGTERM" . (:foreground "#c4013c" :weight bold :box (:line-width 2 :style released-button)))
	  ("CANCELED" . (:foreground "#fc4205" :weight bold :box (:line-width 2 :style released-button)))
	  ))

  (setq org-todo-keywords
	'((sequence "TODO(t/!)" "NEXT(n/!)" "DELEGATED(o)" "WAITING(w@/!)" "FLEETING(f)" "PROJ(p)" "MEETING(m)" "LONGTERM(l@/!)" "REPEAT(r)" "|" "CANCELED(c@/!)" "DONE(d/!)")))

  (setq org-log-repeat nil)
  (setq org-todo-repeat-to-state "REPEAT")
#+END_SRC
*** Coding
When programming I like my editor to try to help me with keeping parentheses balanced.
#+BEGIN_SRC emacs-lisp
  (use-package smartparens
      :config
      (add-hook 'prog-mode-hook 'smartparens-mode))
#+END_SRC
*** Refile
#+BEGIN_SRC emacs-lisp
  (setq org-outline-path-complete-in-steps nil)
  (setq org-completion-use-ido nil)
  (setq org-refile-use-outline-path 't)
  (setq org-refile-allow-creating-parent-nodes 'confirm)

  (defun org-refile-in-file ()
    "Refile to a target within the current file."
    (interactive)
    (let ((org-refile-targets `(((,(buffer-file-name)) :maxlevel . 6))))
      (call-interactively 'org-refile)))

  (setq org-refile-targets '((org-agenda-files :maxlevel . 3)))
#+END_SRC
