.emacs_test.d/exported-org-files/config.tex
\subsubsection{Transparency}
\label{sec:orgd939ef6}
\begin{verbatim}
;;(set-frame-parameter (selected-frame) 'alpha '(<active> . <inactive>))
;;(set-frame-parameter (selected-frame) 'alpha <both>)
(set-frame-parameter (selected-frame) 'alpha '(100 . 100))
(add-to-list 'default-frame-alist '(alpha . (100 . 100)))

(defun toggle-transparency ()
   (interactive)
   (let ((alpha (frame-parameter nil 'alpha)))
     (set-frame-parameter
      nil 'alpha
      (if (eql (cond ((numberp alpha) alpha)
		     ((numberp (cdr alpha)) (cdr alpha))
		     ;; Also handle undocumented (<active> <inactive>) form.
		     ((numberp (cadr alpha)) (cadr alpha)))
	       100)
	  '(95 . 95) '(100 . 100)))))
\end{verbatim}
\subsection{Navigation}
\label{sec:orgd5d1af9}
\subsubsection{avy}
\label{sec:org40c0a3c}
Avy is a powerful search package that lets you quickly navigate to wherever in your screen you want to go.
\begin{verbatim}
(use-package avy :ensure t)
\end{verbatim}
\subsubsection{Multiple Cursors}
\label{sec:org42ed92e}
Use multi cursor editing easily. For keybindings, see \hyperref[sec:org25ccc0c]{Custom keystrokes}.
\begin{verbatim}
(require 'multiple-cursors)
\end{verbatim}
\subsubsection{expand-region}
\label{sec:org132d5e6}
\begin{verbatim}
;;expand region
(require 'expand-region)
(global-set-key (kbd "C-=") 'er/expand-region)
\end{verbatim}
\subsection{Org}
\label{sec:org47b0892}
\subsubsection{Org-bullets}
\label{sec:org03c97cd}
Small package that makes the org hierachy a little bit more appealing. The stars are changed into icons for example.
\begin{verbatim}
(use-package org-bullets
  :ensure t
  :config
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode))))
\end{verbatim}
\subsubsection{Writing improvements}
\label{sec:org5ed7274}
Some of the adjustments are \textbf{stolen} from \href{https://explog.in/notes/writingsetup.html}{this guy}. It mainly revolves around using screenspace efficiently instead of randomly adding whitespace, or not displaying whitespace where there actually is whitespace.
\begin{verbatim}
(setq org-indent-indentation-per-level 1)             ;; Shorten the space on the left side with org headers
(setq org-adapt-indentation nil)                      ;; Adapt indentation to outline node level. Set to nill as it takes up space.
(setq org-hide-emphasis-markers t)                    ;; When making something bold *Hallo*, hide stars. Goes for all emphasis markers.
(setq org-cycle-separator-lines 1)                    ;; Leave a single empty line between headers if there is one. Otherwise leave no room or make the empty lines belong to the previous header.
(setq org-hide-leading-stars 't)                      ;; Hide the extra stars in front of a header (org-bullet displays nicer, but why add extra package)
(customize-set-variable 'org-blank-before-new-entry
			'((heading . nil)
			  (plain-list-item . nil)))   ;; Dont randomly remove newlines below headers
\end{verbatim}
\subsubsection{Image size}
\label{sec:orge888021}
Make standard size for org images. Otherwise they can become gigantic!
\begin{verbatim}
(setq org-image-actual-width 600)
\end{verbatim}
\subsubsection{Org-babel}
\label{sec:orgf4af864}
\begin{verbatim}
(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)))
\end{verbatim}
\subsection{Standards (minor modes and minor improvements)}
\label{sec:orgac19acf}
\subsubsection{Alter annoying defaults}
\label{sec:orgd2c9e4e}
Small defaults to be changed as minor improvements. The changes are summarized next to it.
\begin{verbatim}
(setq save-interprogram-paste-before-kill t) ;; Perpetuates system clipboard
(setq scroll-conservatively 1)      ;; Keep from making huge jumps when scrolling
(setq ring-bell-function 'ignore)   ;; Unable annoying sounds
(setq visible-bell 1)               ;; disable annoying windows sound
(setq inhibit-startup-message t)    ;; Hide the startup message
(setq display-time-24hr-format t)   ;; Format clock
(setq-default display-line-numbers 'relative) ;; Setting the line numbers
(when window-system (global-hl-line-mode t)) ;; Get a current line shadow in IDE
(defalias 'yes-or-no-p 'y-or-n-p)   ;; Replace yes questions to y
(add-hook 'before-save-hook 'delete-trailing-whitespace) ;; I never want whitespace at the end of lines. Remove it on save.
\end{verbatim}
\subsubsection{Hungry-delete}
\label{sec:orgcee2e9a}
Deletes all whitespace with a single delete of backspace.
\begin{verbatim}
(use-package hungry-delete
  :ensure t
  :config (global-hungry-delete-mode))
\end{verbatim}
\subsubsection{Minor modes}
\label{sec:orgc9b1f06}
Some minor modes that are turned on or off. Next to each, a short description is given of what it changes.
\begin{verbatim}
(tool-bar-mode -1)                  ;; Get rid of tool-bar
(menu-bar-mode -1)                  ;; Git rid of menu
(scroll-bar-mode -1)                ;; Get rid of scroll-bar
(global-auto-revert-mode 1)         ;; Make sure that you're always looking at the latest version of a file. Change file when changed on disk
(delete-selection-mode 1)           ;; Remove text from selection instead of just inserting text
(display-time-mode 1)               ;; Set clock on lower right side
;; (electric-pair-mode t)              ;; Enable electric pair mode. It autocompletes certain pairs. E.g., (), {}, [], <>
(global-subword-mode 1)             ;; Cause M-f to move forward per capitalization within a word. E.g., weStopAtEveryCapital
(global-visual-line-mode 1)                ;; Make sure that lines do not disapear at the right side of the screen but wrap around
(add-hook 'prog-mode-hook 'electric-pair-mode)
\end{verbatim}
\subsubsection{Popup kill-ring}
\label{sec:orgbbeaeae}
Show options out of the kill ring instead of cycling through each option.
\begin{verbatim}
(use-package popup-kill-ring
  :ensure t
  :bind ("M-y" . popup-kill-ring))
\end{verbatim}
\subsubsection{Which key}
\label{sec:org595a58b}
Provides options for keystrokes. Super useful!
\begin{verbatim}
(use-package which-key
  :ensure t
  :init
  (which-key-mode))
\end{verbatim}
\subsubsection{TODOS}
\label{sec:org8b3f392}
\begin{verbatim}
(setq org-todo-keyword-faces
      '(
	("DOING" . (:foreground "#05d3fc" :weight bold :box (:line-width 2 :style released-button)))
	("WAITING" . (:foreground "#fcca05" :weight bold :box (:line-width 2 :style released-button)))
	("FLEETING" . (:foreground "#f62af9" :weight bold :box (:line-width 2 :style released-button)))
	("LONGTERM" . (:foreground "#c4013c" :weight bold :box (:line-width 2 :style released-button)))
	("CANCELED" . (:foreground "#fc4205" :weight bold :box (:line-width 2 :style released-button)))
	))

(setq org-todo-keywords
      '((sequence "TODO(t)" "DOING(d)" "WAITING(w)" "FLEETING(f)" "|" "LONGTERM(l)" "CANCELED(c)" "DONE(f)")))
\end{verbatim}
\subsubsection{Coding}
\label{sec:orgcb6762e}
When programming I like my editor to try to help me with keeping parentheses balanced.
\begin{verbatim}
(use-package smartparens
    :config
    (add-hook 'prog-mode-hook 'smartparens-mode))
\end{verbatim}
