.emacs_test.d/config.org
*** Crux
crux has useful functions extracted from Emacs Prelude. Set C-a to move to the first non-whitespace character on a line, and then to toggle between that and the beginning of the line.
#+BEGIN_SRC emacs-lisp
  (use-package crux
    :bind (("C-a" . crux-move-beginning-of-line)))
#+END_SRC
** Try package
Have the option to try packages without actually installing them. If you do

#+BEGIN_SRC
M-x try
#+END_SRC

It will give you the option to temporarily install the package. If you close and reopen emacs, the tried out package is removed.

#+BEGIN_SRC emacs-lisp
  (use-package try
      :ensure t)
#+END_SRC
** Visual
*** Beacon
Small package to provide an idea where in which buffer the cursor is atm by showing a small light in the current frame.
#+BEGIN_SRC emacs-lisp
  (use-package beacon
      :ensure t
      :init
      (beacon-mode 1))
#+END_SRC
*** rainbow
Visualize color codings. So RGB will be colored in its respective color.
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
    :config
    (setq rainbow-x-colors nil)
    (add-hook 'prog-mode-hook 'rainbow-mode))
#+END_SRC

Make visual pairs of delimeters ({<[]>}) etc. Each level gets its own color so it's easy to spot which are pairs.
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :config
    (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
#+END_SRC
*** Doom theme
This causes emacs to look a lot better overall. [[https://github.com/hlissner/emacs-doom-themes][This package]] makes the coloring and font decissions, so you don't have to. There is a seperate package for the mode-line (the line that containts the time and which file etc.)
#+BEGIN_SRC emacs-lisp
  (use-package doom-themes
    :ensure t
    :config
    ;; Global settings (defaults)
    (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	  doom-themes-enable-italic t) ; if nil, italics is universally disabled
    (load-theme 'doom-one t)

    ;; Enable flashing mode-line on errors
    (doom-themes-visual-bell-config)

    ;; Enable custom neotree theme (all-the-icons must be installed!)
    (doom-themes-neotree-config)
    ;; or for treemacs users
    (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
    (doom-themes-treemacs-config)

    ;; Corrects (and improves) org-mode's native fontification.
    (doom-themes-org-config))

  (use-package doom-modeline
    :ensure t
    :hook (after-init . doom-modeline-mode))

  (setq doom-modeline-buffer-file-name-style 'truncate-all)
#+END_SRC
*** all-the-icons
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons :ensure t)
#+END_SRC
** Link to clipboard
#+BEGIN_SRC emacs-lisp
  (defun my/copy-idlink-to-clipboard() "Copy an ID link with the headline to killring, if no ID is there then create a new unique ID. This function works only in org-mode or org-agenda buffers.
  The purpose of this function is to easily construct id:-links to org-mode items. If its assigned to a key it saves you marking the text and copying to the killring."
	 (interactive)
	 (when (eq major-mode 'org-agenda-mode)
	   (org-agenda-show)
	   (org-agenda-goto))
	 (when (eq major-mode 'org-mode) ; do this only in org-mode buffers
	   (setq mytmphead (nth 4 (org-heading-components)))
	   (setq mytmpid (funcall 'org-id-get-create))
	   (setq mytmplink (format "[[id:%s][%s]]" mytmpid mytmphead)) (kill-new mytmplink)
	   (message "Copied %s to killring (clipboard)" mytmplink)
	   ))
#+END_SRC
** Clear checkboxes when done with repeated tasks
#+BEGIN_SRC emacs-lisp
  (defun org-reset-checkbox-state-maybe () "Reset all checkboxes in an entry
  if the `RESET_CHECK_BOXES' property is set" (interactive "∗")
  (if (org-entry-get (point) "RESET_CHECK_BOXES")
      (org-reset-checkbox-state-subtree)))
  (defun org-checklist ()
    (when (member org-state org-done-keywords)
      (org-reset-checkbox-state-maybe)))
  (defun my-clockfiles () (append org-agenda-files
				  (file-expand-wildcards "~/Dropbox/org/track∗.org")))
  (add-hook 'org-after-todo-state-change-hook 'org-checklist)
#+END_SRC
* Shortcuts and how-to's
Here I provide some common shortcuts that I tend to use or want to remember and other useful instructions.
** Shorthand notations
There are some shorthands for certain keys, these are as follows:
|-----------+----------------------------------------|
| Shorthand | Corresponding key                      |
|-----------+----------------------------------------|
| C         | Control                                |
| M         | Meta, option or alt (depending on OS)  |
| RET       | Return or enter                        |
| S         | Shift                                  |
| SPC       | Space bar                              |
| TAB       | Tab key                                |
| prefix    | C-u followed by the shortcut           |
| VERT      | This is a pipe sign |, it is described |
|           | like this since Org treats this as a   |
|           | new column                             |
|-----------+----------------------------------------|
** Emacs
*** General
|-----------+------------------------------------------|
| Shortcuts | Description                              |
|-----------+------------------------------------------|
| C-g       | Quit partially entered command           |
| C-_       | Undo                                     |
| C-x u     | Undo                                     |
| C-/       | Undo                                     |
| C-g C-/   | Undo in reverse direction (C-g reverses) |
| C-x C-s   | save                                     |
| C-x s     | Save some buffers                        |
| M-w       | copy                                     |
| C-w       | cut                                      |
| C-y       | paste                                    |
| C-x C-f   | Find a file                              |
| C-x C-c   | Quit Emacs                               |
| C-x C-=   | Zoom in                                  |
| C-x C--   | Zoom out                                 |
| C-s       | Search                                   |
| C-r       | Reverse search                           |
| M-=       | Show wordcount                           |
| C-SPC     | Marker                                   |
|-----------+------------------------------------------|
*** Navigation
|----------------+-----------------------------------------------------------------------|
| Shortcut       | Description                                                           |
|----------------+-----------------------------------------------------------------------|
| *Beginner*       |                                                                       |
|----------------+-----------------------------------------------------------------------|
| C-u PREFIX     | The "numeric argument" indicates how many times to repeat the command |
| C-v            | Move forward one screenful (next page)                                |
| M-v            | Move back one screenful (previous page)                               |
| C-u PREFIX C-v | Scroll text up by indicated number of lines                           |
| C-u PREFIX M-v | Scroll text down by indicated number of lines                         |
| C-f            | Move cursor a character to the right (forward)                        |
| C-b            | Move cursor a character to left (back)                                |
| M-f            | Move cursor forward one word                                          |
| M-b            | Move cursor back one word                                             |
| C-n            | Move cursor down one line (next)                                      |
| C-p            | Move cursor up one line (previous)                                    |
| C-a            | Move cursor to beginning of line                                      |
| C-e            | Move cursor to end of line                                            |
| M-a            | Move cursor to beginning of sentence                                  |
| M-e            | Move cursor to end of current or next sentence                        |
| M-}            | Move cursor to end or next paragraph                                  |
| M-{            | Move cursor to beginning or previous paragraph                        |
| C-l            | Move text around the cursor to the center of the screen               |
| C-l C-l        | Move text around the cursor to the top of the screen                  |
| C-l C-l C-l    | Move text around the cursor to the bottom of the screen               |
| C-u PREFIX C-l | Move text around the cursor to the specified line                     |
| M-<            | Move cursor to top of document                                        |
| M->            | Move cursor to end of document                                        |
| C-u C-SPC      | Move cursor back to previous position (after jump)                    |
| C-z c          | avy-goto-char, go to any character in the screen by following a code  |
|----------------+-----------------------------------------------------------------------|
| *Intermediate*   |                                                                       |
|----------------+-----------------------------------------------------------------------|
| M-g M-g        | Asks you a number and then goes to that line number                   |
|----------------+-----------------------------------------------------------------------|
