.emacs_test.d/exported-org-files/config.tex

\subsubsection{Crux}
\label{sec:orge6c63f6}
crux has useful functions extracted from Emacs Prelude. Set C-a to move to the first non-whitespace character on a line, and then to toggle between that and the beginning of the line.
\begin{verbatim}
(use-package crux
  :bind (("C-a" . crux-move-beginning-of-line)))
\end{verbatim}
\subsection{Try package}
\label{sec:org299be50}
Have the option to try packages without actually installing them. If you do

\begin{verbatim}
M-x try
\end{verbatim}

It will give you the option to temporarily install the package. If you close and reopen emacs, the tried out package is removed.

\begin{verbatim}
(use-package try
    :ensure t)
\end{verbatim}
\subsection{Visual}
\label{sec:orgfc63ab4}
\subsubsection{Beacon}
\label{sec:org78d77ba}
Small package to provide an idea where in which buffer the cursor is atm by showing a small light in the current frame.
\begin{verbatim}
(use-package beacon
    :ensure t
    :init
    (beacon-mode 1))
\end{verbatim}
\subsubsection{rainbow}
\label{sec:org4848c5e}
Visualize color codings. So RGB will be colored in its respective color.
\begin{verbatim}
(use-package rainbow-mode
  :config
  (setq rainbow-x-colors nil)
  (add-hook 'prog-mode-hook 'rainbow-mode))
\end{verbatim}

Make visual pairs of delimeters (\{<[]>\}) etc. Each level gets its own color so it's easy to spot which are pairs.
\begin{verbatim}
(use-package rainbow-delimiters
  :config
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode))
\end{verbatim}
\subsubsection{Doom theme}
\label{sec:org2c54ca4}
This causes emacs to look a lot better overall. \href{https://github.com/hlissner/emacs-doom-themes}{This package} makes the coloring and font decissions, so you don't have to. There is a seperate package for the mode-line (the line that containts the time and which file etc.)
\begin{verbatim}
(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-one t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1))
\end{verbatim}
\subsubsection{all-the-icons}
\label{sec:org4255132}
\begin{verbatim}
(use-package all-the-icons :ensure t)
\end{verbatim}
\section{Shortcuts and how-to's}
\label{sec:org6fecae0}
Here I provide some common shortcuts that I tend to use or want to remember and other useful instructions.
\subsection{Shorthand notations}
\label{sec:orgcea4987}
There are some shorthands for certain keys, these are as follows:
\begin{center}
\begin{tabular}{ll}
\hline
Shorthand & Corresponding key\\
\hline
C & Control\\
M & Meta, option or alt (depending on OS)\\
RET & Return or enter\\
S & Shift\\
SPC & Space bar\\
TAB & Tab key\\
prefix & C-u followed by the shortcut\\
VERT & This is a pipe sign & , it is described\\
 & like this since Org treats this as a\\
 & new column\\
\hline
\end{tabular}
\end{center}
\subsection{Emacs}
\label{sec:org06073d3}
\subsubsection{General}
\label{sec:orgc5c0ce0}
\begin{center}
\begin{tabular}{ll}
\hline
Shortcuts & Description\\
\hline
C-g & Quit partially entered command\\
C-\_ & Undo\\
C-x u & Undo\\
C-/ & Undo\\
C-g C-/ & Undo in reverse direction (C-g reverses)\\
C-x C-s & save\\
C-x s & Save some buffers\\
M-w & copy\\
C-w & cut\\
C-y & paste\\
C-x C-f & Find a file\\
C-x C-c & Quit Emacs\\
C-x C-= & Zoom in\\
C-x C-- & Zoom out\\
C-s & Search\\
C-r & Reverse search\\
M-= & Show wordcount\\
C-SPC & Marker\\
\hline
\end{tabular}
\end{center}
\subsubsection{Navigation}
\label{sec:org97ebf78}
\begin{center}
\begin{tabular}{ll}
\hline
Shortcut & Description\\
\hline
\textbf{Beginner} & \\
\hline
C-u PREFIX & The "numeric argument" indicates how many times to repeat the command\\
C-v & Move forward one screenful (next page)\\
M-v & Move back one screenful (previous page)\\
C-u PREFIX C-v & Scroll text up by indicated number of lines\\
C-u PREFIX M-v & Scroll text down by indicated number of lines\\
C-f & Move cursor a character to the right (forward)\\
C-b & Move cursor a character to left (back)\\
M-f & Move cursor forward one word\\
M-b & Move cursor back one word\\
C-n & Move cursor down one line (next)\\
C-p & Move cursor up one line (previous)\\
C-a & Move cursor to beginning of line\\
C-e & Move cursor to end of line\\
M-a & Move cursor to beginning of sentence\\
M-e & Move cursor to end of current or next sentence\\
M-\} & Move cursor to end or next paragraph\\
M-\{ & Move cursor to beginning or previous paragraph\\
C-l & Move text around the cursor to the center of the screen\\
C-l C-l & Move text around the cursor to the top of the screen\\
C-l C-l C-l & Move text around the cursor to the bottom of the screen\\
C-u PREFIX C-l & Move text around the cursor to the specified line\\
M-< & Move cursor to top of document\\
M-> & Move cursor to end of document\\
C-u C-SPC & Move cursor back to previous position (after jump)\\
C-z c & avy-goto-char, go to any character in the screen by following a code\\
\hline
\textbf{Intermediate} & \\
\hline
M-g M-g & Asks you a number and then goes to that line number\\
\hline
\end{tabular}
\end{center}
