.emacs_test.d/config.org
*** Buffers
|-----------------------+----------------------------------------------------------------|
| Shortcut              | Description                                                    |
|-----------------------+----------------------------------------------------------------|
| C-x C-b               | Show list of currently existing buffers                        |
| C-x b                 | Switch to another buffer by typing its name                    |
| C-x o                 | Jump to other buffer                                           |
| C-x k                 | Kill buffer                                                    |
| C-x 0                 | Kill selected buffer                                           |
| C-x 1                 | Kill all buffers except selected one                           |
| C-x 2                 | Split selected buffer horizontally                             |
| C-x 3                 | Split selected buffer vertically                               |
| C-x 4 C-f BUFFER NAME | Open new window with desired buffer in it                      |
| C-x 5 2               | Open new frame                                                 |
| C-x 5 0               | Remove selected frame                                          |
| C-M-v                 | Scroll in non-selected buffer (without abandoning current one) |
|-----------------------+----------------------------------------------------------------|
*** Editing
|----------------+------------------------------------------------------------|
| Shortcut       | Description                                                |
|----------------+------------------------------------------------------------|
| <DEL>          | Delete the character before the cursor                     |
| C-d            | Delete the character after the cursor                      |
| M-<DEL>        | Kill the word before the cursor                            |
| M-d            | Kill the word after the cursor                             |
| C-k            | Kill from the cursor position to the end of the line       |
| M-k            | Kill from the cursor position to the end of the sentence   |
| C-0 C-k        | Kill from the cursor position to the beginning of the line |
| C-S-<DEL>      | Delete the whole line, regarless of cursor position        |
| C-u PREFIX C-k | Kills specified number of lines AND their contents         |
| * text *       | *Bolds* text                                                 |
| / text /       | /Italicizes/ text                                            |
| _ text _       | _Underlines_ text                                            |
| = text =       | Makes text =green= (without spaces)                          |
| ~ text ~       | Makes text ~orange~ (without spaces)                         |
|----------------+------------------------------------------------------------|
** Org
*** Regular ORG
|------------------+--------------------------------------------------------------|
| Shortcut         | Description                                                  |
|------------------+--------------------------------------------------------------|
| C-c n f          | Create new file                                              |
| C-RET            | Add headder                                                  |
| M-S-RET          | Add extra todo checklist item to a list                      |
| M-S-RET [@INDEX] | Add extra todo checklist item with desired numbering         |
| C-c C-t          | Jump straight to the right TODO keyword                      |
| C-LEFT / C-RIGHT | Cycle through TODO keywords                                  |
| C-c C-c          | Check the checkbox                                           |
| C-q              | Add a tagg to a header                                       |
| C-c C-x S-o      | Make a TODO tree ordered (i.e. cannot set DONE out of order) |
| C-c C-x C-c      | Change view to column view                                   |
| C-c C-c          | WHEN IN COLUMN VIEW: change back                          |
|------------------+--------------------------------------------------------------|
*** Timer and clocking
|-----------------+----------------------------------------------------------------------------------|
| Shortcut        | Description timer                                                                |
|-----------------+----------------------------------------------------------------------------------|
| C-c C-x 0       | Use a up counting times (when prepended with C-u it prompts for offset of timer) |
| C-c C-x ,       | Pause and resume timer (when prepended with C-u it stops timer)                  |
| C-c C-x .       | When running timer, insert timestamp H:MM:SS                                     |
| C-c C-x -       | When running timer, insert timestamp of form - H:MM:SS :: tekst                  |
|-----------------+----------------------------------------------------------------------------------|
| Shortcut        | Description clock                                                                |
|-----------------+----------------------------------------------------------------------------------|
| C-c C-x i       | Clock in                                                                         |
| C-c C-x o       | Clock out                                                                        |
| C-c C-x q       | Quit/cancel current clock                                                        |
| C-c C-x j       | Go to current clock or last running clock                                        |
| C-c C-x C-x     | Work again on last running clock                                                 |
| C-u C-c C-x C-x | Get list of previously used clocks and choose which to work on                   |
| l               | *IN AGENDA VIEW* to see clocked efforts at right timing                            |
| C-c C-x d       | Show overlay in which total work time is calculated                              |
| C-c C-c         | Remove overlay                                                                   |
|-----------------+----------------------------------------------------------------------------------|

*** Roam
|----------+-------------|
| Shortcut | Description |
|----------+-------------|
|----------+-------------|
*** Tables
Here are some shortcuts that I regularly use or want to have handy nearby.  For a more exhaustive list, check [[https://orgmode.org/manual/Built_002din-Table-Editor.html#Built_002din-Table-Editor][the org table manual]].

_How to make a table step by step:_
1. Write the headers of the columns separated by commas
2. Select the line with column names
3. C-c |
4. C-c RET
5. C-c -
6. Drag line using M-UP or M-DOWN

|------------------------+------------------------------------------------------------------------|
| Shortcut               | Description                                                            |
|------------------------+------------------------------------------------------------------------|
| *Re-aligning and motion* |                                                                        |
|------------------------+------------------------------------------------------------------------|
| C-c C-c                | Re-align without moving                                                |
| TAB                    | Re-align table, move to next field and create new row if needed        |
| RET                    | Move cursor to next row or create a row (useful with horizontal lines) |
| M-a or M-e             | Move to beginning or end of current field, or next field               |
| M-RET                  | Split line vertically on overflow of column (split row into 2)         |
|------------------------+------------------------------------------------------------------------|
| *Regions*                |                                                                        |
|------------------------+------------------------------------------------------------------------|
| M-RET                  | Split current field at point and paste what comes after to new line    |
|------------------------+------------------------------------------------------------------------|
| *Column and Row editing* |                                                                        |
|------------------------+------------------------------------------------------------------------|
| C-c RET                | Insert horizontal line                                                 |
| C-c -                  | Insert a horizontal line below, with prefix it is above                |
| C-c ^                  | Sort by column on point                                                |
| S-ARROW_KEY            | Move current cell in the direction of the used arrow key               |
| M-ARROW_KEY            | Move current column or row in the direction of the used arrow key      |
| M-S-LEFT or M-S-UP     | Kill current column or row, respectively                               |
| M-S-RIGHT or M-S-DOWN  | Add column or row                                                      |
|------------------------+------------------------------------------------------------------------|
| *Calculations*           |                                                                        |
|------------------------+------------------------------------------------------------------------|
| C-c +                  | You can paste (C-y) a column sum into a field                          |
| S-RET                  | Auto-increment downward is current field is a number or if current     |
|                        | is empty, copy the one from above.                                     |
|------------------------+------------------------------------------------------------------------|
| *Misc*                   |                                                                        |
|------------------------+------------------------------------------------------------------------|
| C-c VERT               | Create table or convert from region (csv style)                        |
| C-c `                  | Used if you want a seperate buffer to alter a field                    |
|------------------------+------------------------------------------------------------------------|
*** Exporting
