.emacs_test.d/exported-org-files/config.tex
\subsubsection{Buffers}
\label{sec:org46191c0}
\begin{center}
\begin{tabular}{ll}
\hline
Shortcut & Description\\
\hline
C-x C-b & Show list of currently existing buffers\\
C-x b & Switch to another buffer by typing its name\\
C-x o & Jump to other buffer\\
C-x k & Kill buffer\\
C-x 0 & Kill selected buffer\\
C-x 1 & Kill all buffers except selected one\\
C-x 2 & Split selected buffer horizontally\\
C-x 3 & Split selected buffer vertically\\
C-x 4 C-f BUFFER NAME & Open new window with desired buffer in it\\
C-x 5 2 & Open new frame\\
C-x 5 0 & Remove selected frame\\
C-M-v & Scroll in non-selected buffer (without abandoning current one)\\
\hline
\end{tabular}
\end{center}
\subsubsection{Editing}
\label{sec:orgd92e6e5}
\begin{center}
\begin{tabular}{ll}
\hline
Shortcut & Description\\
\hline
<DEL> & Delete the character before the cursor\\
C-d & Delete the character after the cursor\\
M-<DEL> & Kill the word before the cursor\\
M-d & Kill the word after the cursor\\
C-k & Kill from the cursor position to the end of the line\\
M-k & Kill from the cursor position to the end of the sentence\\
C-0 C-k & Kill from the cursor position to the beginning of the line\\
C-S-<DEL> & Delete the whole line, regarless of cursor position\\
C-u PREFIX C-k & Kills specified number of lines AND their contents\\
* text * & \textbf{Bolds} text\\
/ text / & \emph{Italicizes} text\\
\_ text \_ & \uline{Underlines} text\\
= text = & Makes text \texttt{green} (without spaces)\\
\textasciitilde{} text \textasciitilde{} & Makes text \texttt{orange} (without spaces)\\
\hline
\end{tabular}
\end{center}
\subsection{Org}
\label{sec:org86d308a}
\subsubsection{Regular ORG}
\label{sec:orgc102f51}
\begin{center}
\begin{tabular}{ll}
\hline
Shortcut & Description\\
\hline
C-c n f & Create new file\\
C-RET & Add headder\\
M-S-RET & Add extra todo checklist item to a list\\
M-S-RET [@INDEX] & Add extra todo checklist item with desired numbering\\
C-c C-c & Check the checkbox\\
\hline
\end{tabular}
\end{center}
\subsubsection{Roam}
\label{sec:org0390aef}
\begin{center}
\begin{tabular}{ll}
\hline
Shortcut & Description\\
\hline
\hline
\end{tabular}
\end{center}
\subsubsection{Tables}
\label{sec:orgcfe5207}
Here are some shortcuts that I regularly use or want to have handy nearby.  For a more exhaustive list, check \href{https://orgmode.org/manual/Built\_002din-Table-Editor.html\#Built\_002din-Table-Editor}{the org table manual}.

\uline{How to make a table step by step:}
\begin{enumerate}
\item Write the headers of the columns separated by commas
\item Select the line with column names
\item C-c |
\item C-c RET
\item C-c -
\item Drag line using M-UP or M-DOWN
\end{enumerate}

\begin{center}
\begin{tabular}{ll}
\hline
Shortcut & Description\\
\hline
\textbf{Re-aligning and motion} & \\
\hline
C-c C-c & Re-align without moving\\
TAB & Re-align table, move to next field and create new row if needed\\
RET & Move cursor to next row or create a row (useful with horizontal lines)\\
M-a or M-e & Move to beginning or end of current field, or next field\\
\hline
\textbf{Regions} & \\
\hline
M-RET & Split current field at point and paste what comes after to new line\\
\hline
\textbf{Column and Row editing} & \\
\hline
C-c RET & Insert horizontal line\\
C-c - & Insert a horizontal line below, with prefix it is above\\
C-c \^{} & Sort by column on point\\
S-ARROW\textsubscript{KEY} & Move current cell in the direction of the used arrow key\\
M-ARROW\textsubscript{KEY} & Move current column or row in the direction of the used arrow key\\
M-S-LEFT or M-S-UP & Kill current column or row, respectively\\
M-S-RIGHT or M-S-DOWN & Add column or row\\
\hline
\textbf{Calculations} & \\
\hline
C-c + & You can paste (C-y) a column sum into a field\\
S-RET & Auto-increment downward is current field is a number or if current\\
 & is empty, copy the one from above.\\
\hline
\textbf{Misc} & \\
\hline
C-c VERT & Create table or convert from region (csv style)\\
C-c ` & Used if you want a seperate buffer to alter a field\\
\hline
\end{tabular}
\end{center}
