.emacs_test.d/config.org
*** Journal
All journal entries are registered in the Emacs Calendar. To see available journal entries do ~M-x calendar~. Bindings available in the =calendar-mode=:
|-----------+------------------------------------------------------------------------|
| Shortcut  | Description                                                            |
|-----------+------------------------------------------------------------------------|
| C-c C-c j | Use org-capture to start a new days entry and carry TODO's to this day |
| C-z C-t   | Go to todays entry                                                     |
| C-z C-j   | Make a new time-stamp in todays entry                                  |
| C-c C-f   | Go to next journal file                                                |
| C-c C-b   | Go to previoous journal file                                           |
|-----------+------------------------------------------------------------------------|
| j m       | mark entries in calendar                                               |
| j r       | view an entry in a new buffer.                                         |
| j d       | view an entry but do not switch to it.                                 |
| j n       | add a new entry into the day’s file (creates the file if not present). |
| j s w     | search in all entries of the current week.                             |
| j s m     | search in all entries of the current month.                            |
| j s y     | search in all entries of the current year.                             |
| j s f     | search in all entries of all time.                                     |
| j s F     | search in all entries in the future.                                   |
| [         | go to previous day with journal entries.                               |
| ]         | go to next day with journal entries.                                   |
|           |                                                                        |
|-----------+------------------------------------------------------------------------|
** Agenda
|--------------------+-------------------------------------|
| Shortcut           | Description                         |
|--------------------+-------------------------------------|
| C-u NUMBER C-z a a | Open agenda for next NUMBER of days |
| f                  | Move forward in agenda              |
| b                  | Move backwards in agenda            |
|--------------------+-------------------------------------|
** Archiving and note taking
|-------------+-------------------------------------|
| Shortcut    | Description                         |
|-------------+-------------------------------------|
| C-c C-x C-s | Archive current TODO tree           |
| C-c C-z     | Make a quick note in LOGBOOK drawer |
|             |                                     |
|-------------+-------------------------------------|

** Step by step instructions
_How to modify a config file or custom config file step by step:_
1. C-z E to open config file
2. Modify whatever you want
3. C-x Cs to save file
4. C-z r to reload the config file
_How to create a new folder saved in dropbox_
1. C-x C-f to create a new file
2. ~/ to go to home directory
3. ~/Dropbox to go to dropbox
4. /file_name
5. M-x RET RET to create a new directory (new folder) /or/ C-x C-s to create new file
