.emacs_test.d/exported-org-files/config.tex
\subsubsection{Exporting}
\label{sec:org17abea9}
\subsection{Custom}
\label{sec:org99c0552}
\begin{center}
\begin{tabular}{ll}
\hline
Shortcut & Description\\
\hline
 & \\
\hline
\end{tabular}
\end{center}
\subsection{Step by step instructions}
\label{sec:org69c401a}
\uline{How to modify a config file or custom config file step by step:}
\begin{enumerate}
\item C-z E to open config file
\item Modify whatever you want
\item C-x Cs to save file
\item C-z r to reload the config file
\end{enumerate}
\uline{How to create a new folder saved in dropbox}
\begin{enumerate}
\item C-x C-f to create a new file
\item \textasciitilde{}/ to go to home directory
\item \textasciitilde{}/Dropbox to go to dropbox
\item /file\textsubscript{name}
\item M-x RET RET to create a new directory (new folder) \emph{or} C-x C-s to create new file
\end{enumerate}
\end{document}
